## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.cinema is tainted, so must be replaced
-/+ resource "argocd_application" "cinema" {
!       id      = "cinema" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 90 -> (known after apply)
            name             = "cinema"
!           resource_version = "1938222" -> (known after apply)
!           uid              = "f3da1fd7-03c1-4531-9b5e-7850530905aa" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # argocd_application.cinema-robusta is tainted, so must be replaced
-/+ resource "argocd_application" "cinema-robusta" {
!       id      = "robusta" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 5 -> (known after apply)
            name             = "robusta"
!           resource_version = "1937623" -> (known after apply)
!           uid              = "57a5edb4-4314-4971-9921-2385e2c15da9" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   value_files  = [] -> null
                    # (3 unchanged attributes hidden)

!                   parameter {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                }
            }

!           sync_policy {
-               automated    = {} -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-bookings is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-bookings" {
!       id      = "keda-cinema-bookings" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 5 -> (known after apply)
            name             = "keda-cinema-bookings"
!           resource_version = "1937616" -> (known after apply)
!           uid              = "b39f4f76-272e-433b-8c18-e286dcd32dab" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-bookings" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-bookings" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-bookings"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-bookings"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-movies is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-movies" {
!       id      = "keda-cinema-movies" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 5 -> (known after apply)
            name             = "keda-cinema-movies"
!           resource_version = "1937619" -> (known after apply)
!           uid              = "f4d82805-c096-447d-8eb3-90e8a6898525" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-movies" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-movies" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-movies"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-movies"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-showtimes is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-showtimes" {
!       id      = "keda-cinema-showtimes" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 5 -> (known after apply)
            name             = "keda-cinema-showtimes"
!           resource_version = "1937618" -> (known after apply)
!           uid              = "c7d3b887-891f-4a7e-93e2-c2be1a7ac420" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-showtimes" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-showtimes" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-showtimes"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-showtimes"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-users is tainted, so must be replaced
-/+ resource "argocd_application" "keda-scaledobject-cinema-users" {
!       id      = "keda-cinema-users" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 5 -> (known after apply)
            name             = "keda-cinema-users"
!           resource_version = "1937617" -> (known after apply)
!           uid              = "43238cd1-4bdb-4070-8d46-2c64e4f32186" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

            destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema-users" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema-users" -> null
                    }
+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-users"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-users"
                    }
                }
            }
        }
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
